关于我的个人成长：
记得刚来公司面试，田总问的我最后一个问题是你对自己将来的发展有什么看法，然而那时我吹了一个牛，
我说我会紧跟着前端前沿技术的发展，其实我那时候也就知道前端三大框架而已；
那接下来我又要吹一个牛B，那就是我经常会想怎样提升自己的技术，
因为我很懒，没有做过多的实践项目，每当我动起手来实践项目的时候又被很多文章或言论给吸引了，
虽然没有因此提高自己的技术能力，但是我对前端的技术了解的更深了，
前端现在就像一个发展中的国家，以前落后的时候没人玩，现在也只是跟随外国前端界的状况
举例来说，前端有造很多轮子也就是一些js库或者框架，但是一个框架火不火，最关键的不是技术实现上多牛逼，
而是在于这个框架在它所处的时代是否代表了一种先进的开发理念。
如果是我要做一个能火起来的框架，一部分是眼界，一部分是时势。
首先只有把眼界开拓到当前领域的边界之外，才可能做出开拓这个领域的东西。
另一部分是时势，你的框架理念要符合当今业界的普遍需求。
这里说一下vue，那就是vue的作者尤雨溪，为什么要说到他，那就是公司前端用到了vue的技术栈，
他让我进入了同天下，在我眼里尤雨溪就像神一样，不是因为他开发的vue技术有多牛逼，
而是他成功的运营了这个开源项目，vue的语法简单让中国的前端学起来方便了，而且全国人民都在用。
不得不承认，即使放眼全球，前端开发理念相比软件开发的其他领域,也基本上属于一个跟随的状态.
比如函数式编程,react就是一个代表，函数式的视图渲染思维。cycle.js,响应式编程等等。
未来目标是跟随前端技术发展，做的项目给公司赚钱










那到了现在我到底有没有跟随前端的前沿技术发展，答案是没有，因为我很懒导致我的技术还差的远，但是我对前端的技术了解的更深了，为什么这么说，因为有的人还不太了解前端，


不跟着前端技术发展，就会被淘汰。。。