关于我的个人成长：

记得刚来公司面试，田总问的我最后一个问题是你对自己将来的发展有什么看法，然而那时我吹了一个牛，我说我会紧跟着前端前沿技术的发展，其实我那时候也就知道前端三大框架而已；
那接下来我又要吹一个牛B，那就是我经常会想怎样提升自己的技术，但是我很懒，没有做过多的实践，每当我动起手来实践项目的时候又被很多文章或言论给吸引了，虽然没有因此提高自己的技术能力，
但是我对前端的技术了解的更深了，为什么这么说，因为有的人还不太了解前端，记得昨天技术大牛天赐说了node推动了前端的发展，的确现在的前端还在发展中。
举例来说，前端有造很多轮子也就是一些js库或者框架，但是一个框架火不火，最关键的不是技术实现上多牛逼，
而是在于这个框架在它所处的时代是否代表了一种先进的开发理念。
比如说，以前在需要兼容各种浏览器的时候，jquery爽快的操作dom,还能兼容各种浏览器，慢慢的，大家发现前端要做应用，光爽快的操作dom不够，
还需要应用结构，这时候backbone出现了，让我们发现了前端也是可以有架构的。慢慢的又需要mvvm数据绑定，出现了angular、vue。
说到vue，那就是vue的作者尤雨溪，为什么要说到他，那就是他让我进入了同天下，还有一个原因是因为他是我的偶像，
在我眼里他就像神一样，不是因为他开发的vue技术有多牛逼，而是他成功的运营了这个开源项目，vue的语法简单让中国的前端学起来方便了，而且全国人民都在用。
不得不承认，即使放眼全球，前端开发理念相比软件开发的其他领域,也基本上属于一个跟随的状态.比如函数式编程,react就是一个代表，函数式的视图渲染思维。











那到了现在我到底有没有跟随前端的前沿技术发展，答案是没有，因为我很懒导致我的技术还差的远，但是我对前端的技术了解的更深了，为什么这么说，因为有的人还不太了解前端，


不跟着前端技术发展，就会被淘汰。。。